"""
Дана строка. Замените в этой строке все цифры 1 на слово one.
"""

str = input()

str = str.replace("1", "one")
print(str)
