"""
Дана строка. Удалите из этой строки все символы @.
"""

str = input()
str = str.replace("@", "")

print(str)
